blog/2021/professional-javascript-for-web-developers.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 12:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>JavaScript 高级程序设计第 4 版</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">JavaScript 高级程序设计第 4 版</h1>
</header><p>
「迭代」是指，按照顺序多次执行程序，一般有明确的终止条件。ES6 规范新增了两个高级特性：迭代器和生成器。它们能帮助我们更好地实现迭代。
</p>

<div id="outline-container-org1dd1374" class="outline-2">
<h2 id="org1dd1374">什么是迭代？</h2>
<div class="outline-text-2" id="text-org1dd1374">
<p>
在 JS 中，计数循环是一种最为简单的迭代：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">i</span> = 1; i &lt;= 20; ++i) {
    console.log(i);
}
</pre>
</div>

<p>
循环是迭代机制的基础，这是因为循环可以指定迭代次数，以及每次迭代的操作。
</p>

<p>
迭代会在一个有序集合上进行。数组是 JS 中有序集合的典型例子：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">collection</span> = [<span style="color: #ddbc91;">'foo'</span>, <span style="color: #ddbc91;">'bar'</span>, <span style="color: #ddbc91;">'baz'</span>];

<span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">index</span> = 0; index &lt; collection.length; ++index) {
    console.log(collection[index])
}
</pre>
</div>

<p>
数组的长度已知，且可以索引到每一项，所以整个数组可以通过递增索引来遍历。但是，通过这种循环执行例程并不理想，原因如下：
</p>

<ol class="org-ol">
<li>迭代之前需要事先知道如何使用数据结构</li>
<li>遍历顺序不是数据结构固有的</li>
</ol>

<p>
ES5 新增了 <code>Array.prototype.forEach()</code> 方法，部分解决了通过迭代的需要（但不够理想）：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">collection</span> = [<span style="color: #ddbc91;">'foo'</span>, <span style="color: #ddbc91;">'bar'</span>, <span style="color: #ddbc91;">'baz'</span>];

collection.forEach((item) =&gt; console.log(item));
</pre>
</div>

<p>
该方法解决了「单独记录索引」和「通过数组对象取值」的问题，但无法标识迭代的终止时间。故而它只适用于「数组」，且回调结构笨拙。
</p>

<p>
迭代器就是为了解决「使用过多循环导致代码混乱度增加」而出现的。
</p>
</div>
</div>

<div id="outline-container-org437d4f9" class="outline-2">
<h2 id="org437d4f9">迭代器模式</h2>
<div class="outline-text-2" id="text-org437d4f9">
<p>
迭代器模式使某些结构被称为「可迭代对象」（iterable），因为它们实现了正式的 Iterable 接口，而且可通过迭代器 Iterator 消费（？）。
</p>

<p>
可迭代对象，具体来讲可理解为数组或集合，这样的集合类型对象。特点：「有限元素」，「无歧义的遍历顺序」。
</p>

<p>
可迭代对象不仅可以是集合类型对象，也可以是仅仅具有类似数组行为的其他数据结构，比如文章开头的计数循环。该循环生成的值是暂时的，但循环本身在执行迭代。
</p>

<p>
任何实现 Iterable 接口的数据结构都可以被实现 Iterator 接口的结构「消费」（consume）。
</p>

<p>
<b>迭代器（iterator）是按需创建的一次性对象。每个迭代器都会关联一个可迭代对象，而迭代器会暴露迭代其关联可迭代对象的 API。迭代器不关心可迭代对象的内部结构，只关心如何取得连续的值。</b>
</p>
</div>

<div id="outline-container-org505aa66" class="outline-3">
<h3 id="org505aa66">可迭代协议</h3>
<div class="outline-text-3" id="text-org505aa66">
<p>
实现 Iterable 接口（可迭代协议）要求同时具备两种能力：「支持迭代的自我识别」和「创建实现 Iterator 接口的对象」。
</p>

<p>
实现了 Iterable 接口的内置类型：
</p>

<ul class="org-ul">
<li>字符串</li>
<li>数组</li>
<li>映射</li>
<li>集合</li>
<li>arguments 对象</li>
<li>NodeList 等 DOM 集合类型</li>
</ul>

<p>
问题：什么是工厂函数？
</p>

<p>
解答：它是<a href="javascript-factory-functions.html">返回新对象的函数</a>。
</p>

<p>
实现可迭代协议的所有类型，都会自动兼容接收可迭代对象的任何语言特性。接收可迭代对象的原生语言特性包括：
</p>

<ul class="org-ul">
<li>for-of 循环</li>
<li>数组解构</li>
<li>扩展操作符</li>
<li>Array.form()</li>
<li>创建集合</li>
<li>创建映射</li>
<li>Promise.all() 接收由期约组成的可迭代对象</li>
<li>Promise.race() 接收由期约组成的可迭代对象</li>
<li>yield* 操作符，在生成器中使用</li>
</ul>

<p>
这些原生语言结构会在后台调用提供的可迭代对象的这个工厂函数，从而创建一个迭代器：
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">arr</span> = [<span style="color: #ddbc91;">"foo"</span>, <span style="color: #ddbc91;">"bar"</span>, <span style="color: #ddbc91;">"baz"</span>];

<span style="color: #706565;">// </span><span style="color: #857575;">for...of &#24490;&#29615;</span>
<span style="color: #91a0b3;">for</span> (<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">el</span> of arr) {
    console.log(el);
}

<span style="color: #706565;">// </span><span style="color: #857575;">&#25968;&#32452;&#35299;&#26500;</span>
<span style="color: #91a0b3;">let</span> [<span style="color: #aaca86;">a</span>, <span style="color: #aaca86;">b</span>, <span style="color: #aaca86;">c</span>] = arr;
console.log(a, b, c);

<span style="color: #706565;">// </span><span style="color: #857575;">&#25193;&#23637;&#25805;&#20316;&#31526;</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">arr2</span> = [...arr];
console.log(arr2);

<span style="color: #706565;">// </span><span style="color: #857575;">Array.from()</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">arr3</span> = Array.from(arr);
console.log(arr3);

<span style="color: #706565;">// </span><span style="color: #857575;">Set &#26500;&#36896;&#20989;&#25968;</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">set</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Set</span>(arr);
console.log(set);

<span style="color: #706565;">// </span><span style="color: #857575;">Map &#26500;&#36896;&#20989;&#25968;</span>
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">pairs</span> = arr.map((x, i) =&gt; [x,, i]);
console.log(pairs);
<span style="color: #91a0b3;">let</span> <span style="color: #aaca86;">map</span> = <span style="color: #91a0b3;">new</span> <span style="color: #ad8572;">Map</span>(pairs);
console.log(map);
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>